projects/HelloLib/hello.wsdl

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="helloService" targetNamespace="http://www.example.com/service" xmlns:hi="http://www.example.com/hello" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:srv="http://www.example.com/service" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <wsdl:documentation>
    <wsdl:appinfo source="WMQI_APPINFO">
      <MRWSDLAppInfo imported="true">
        <binding hasEncoding="false" imported="true" name="serviceBinding" originalBindingStyle="document"/>
      </MRWSDLAppInfo>
    </wsdl:appinfo>
  </wsdl:documentation>

	<wsdl:types>
		<xsd:schema>
<xsd:import namespace="http://www.example.com/hello" schemaLocation="hello_request.xsd"/>
<xsd:import namespace="http://www.example.com/hello" schemaLocation="hello_response.xsd"/>
</xsd:schema>
	</wsdl:types>

	<wsdl:message name="helloRequestMessage">
		<wsdl:part element="hi:helloRequest" name="helloRequest"/>
	</wsdl:message>

	<wsdl:message name="helloResponseMessage">
		<wsdl:part element="hi:helloResponse" name="helloResponse"/>
	</wsdl:message>

	<wsdl:portType name="servicePortType">
		<wsdl:operation name="hello">
			<wsdl:input message="srv:helloRequestMessage" name="helloRequest"/>
			<wsdl:output message="srv:helloResponseMessage" name="helloResponse"/>
		</wsdl:operation>
	</wsdl:portType>

	<wsdl:binding name="serviceBinding" type="srv:servicePortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="hello">
			<soap:operation soapAction="http://www.example.com/service/hello" style="document"/>
			<wsdl:input name="helloRequest">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="helloResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>

	<wsdl:service name="serviceName">
		<wsdl:port binding="srv:serviceBinding" name="servicePort">
			<soap:address location="http://www.example.com/service"/>
		</wsdl:port>
	</wsdl:service>

</wsdl:definitions>