backup/ace/test/hello/soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<hi:helloRequest xmlns:hi="http://www.example.com/hello" >
			<hi:name>Herbert</hi:name>
		</hi:helloRequest>
	</soap:Body>
</soap:Envelope>
